Repository: atageldi194229/rider_app
Catalog: lib/l10n/app_*.arb
Languages: tk

source: Login
tk: Giriş

source: Password
tk: Parol

source: Phone
tk: Telefon

source: Login failure
tk: Giriş şowsuzlygy

# networkError
source: A network error has occurred. Check your connection and try again.
tk: Torda ýalňyşlyk ýüze çykdy. Baglanyşygyňyzy barlaň we gaýtadan synanyşyň.

# networkErrorButton
source: Try Again
tk: Täzeden synanş

source: Empty list
tk: Boş sanaw

# zoneId
source: Zone
tk: Zona

# distanceText
source: Distance
tk: Uzakly

# durationText
source: Duration
tk: Ýol wagty

source: Status
tk: Ýagdaýy

source: Started at
tk: Başlan wagty

source: Completed at
tk: Gutaran wagty

source: Difference in minutes
tk: Umumy wagty

source: Rides
tk: Eltip bermeler

# activeRide
source: Active
tk: Işjeň

source: History
tk: Sargyt taryhy

source: Settings
tk: Sazlamar

source: Logout
tk: Çykmak

source: Start
tk: Başla

source: Arrived
tk: Geldim

source: Deliver
tk: Gowşyr

source: Complete
tk: Tamamla

source: Note
tk: Bellik

source: Notes
tk: Bellikler

source: Order ID
tk: Sargyt belgisi

source: Customer name
tk: Müşderiniň ady

source: Customer phone
tk: Müşderi telefon belgisi

source: Pay method
tk: Töleg usuly

source: Goods to be delivered
tk: Getirilip berilmeli harytlar

source: Total weight
tk: Jemi agram

source: Address
tk: Salgysy

source: Address title
tk: Ady

# addressBuilding
source: Building
tk: Jaý

# addressFloor
source: Floor
tk: Gat

# addressDoor
source: Door
tk: Otag

source: Cash
tk: Nagt

source: Card
tk: Kart

source: Other
tk: Beýleki

source: Complete payment
tk: Tölegi tamamla

source: Order products
tk: Harytlar

source: Order detail
tk: Sargyt

source: Ride detail
tk: Eltip berme

source: Reports
tk: Hasabatlar

source: Terminal code
tk: Terminal kody

source: Cash payment amount
tk: Nagt töleginiň mukdary

source: Card payment amount
tk: Kart töleginiň mukdary

source: Cash change amount
tk: Gaýtargy mukdary

source: Base URL
tk: Esasy URL

source: Language
tk: Dil

source: Restore default settings
tk: Bellenen sazlamalary dikelt

source: Save failure
tk: Ýatda saklandy

source: Save succeeded
tk: Ýatda saklap bolmady

# dioConnectionTimeout
source: Sorry, the app could not connect to the server within the specified time limit. Please check your internet connection and try again later. If the problem persists, you can contact our support team for assistance. Thank you for your patience and understanding.
tk: Bagyşlaň, programma bellenilen möhletde serwere birigip bilmedi. Internet birikmäňizi barlaň we soňrak synanyşyň. Mesele dowam etse, kömek üçin goldaw toparymyza ýüz tutup bilersiňiz. Sabyr edeniňiz we düşüneniňiz üçin sag boluň.

# dioSendTimeout
source: Sorry, the app could not send data to the server within the specified time limit. Please check your internet connection and try again later. If the problem persists, you can contact our support team for assistance. Thank you for your patience and understanding.
tk: Bagyşlaň, programma bellenilen möhletde serwere maglumat iberip bilmedi. Internet birikmäňizi barlaň we soňrak synanyşyň. Mesele dowam etse, kömek üçin goldaw toparymyza ýüz tutup bilersiňiz. Sabyr edeniňiz we düşüneniňiz üçin sag boluň.

# dioReceiveTimeout
source: Sorry, the app could not receive data from the server within the specified time limit. Please check your internet connection and try again later. If the problem persists, you can contact our support team for assistance. Thank you for your patience and understanding.
tk: Bagyşlaň, programma bellenilen möhletde serwerden maglumat alyp bilmedi. Internet birikmäňizi barlaň we soňrak synanyşyň. Mesele dowam etse, kömek üçin goldaw toparymyza ýüz tutup bilersiňiz. Sabyr edeniňiz we düşüneniňiz üçin sag boluň.

# dioBadCertificate
source: Sorry, the app could not establish a secure connection with the server because of an invalid or untrusted SSL certificate. Please check your network settings and make sure you are accessing a trusted site. If the problem persists, you can contact our support team for assistance. Thank you for your security and privacy.
tk: Bagyşlaň, programma nädogry ýa-da ynamsyz SSL şahadatnamasy sebäpli serwer bilen ygtybarly baglanyşyk gurup bilmedi. Tor sazlamalaryňyzy barlaň we ygtybarly sahypa girýändigiňize göz ýetiriň. Mesele dowam etse, kömek üçin goldaw toparymyza ýüz tutup bilersiňiz. Howpsuzlygyňyz we gizlinligiňiz üçin sag boluň.

# dioBadResponse
source: Sorry, the app could not process the response from the server because of an error or an issue. Please check your input data and make sure it is valid and correct. If the problem persists, you can contact our support team for assistance. Thank you for your cooperation and feedback.
tk: Bagyşlaň, programma säwlik ýa-da mesele sebäpli serwerden jogap alyp bilmedi. Giriş maglumatlaryňyzy barlaň we dogrudygyna göz ýetiriň. Mesele dowam etse, kömek üçin goldaw toparymyza ýüz tutup bilersiňiz. Hyzmatdaşlygyňyz we pikirleriňiz üçin sag boluň.

# dioCancel
source: Sorry, the app canceled your request before it was completed. Please check your network connection and make sure you did not interrupt or close the app while it was processing your request. If you want to retry your request, please do so now. Thank you for your patience and understanding.
tk: Bagyşlaň, programma haýyşyňyz gutarmanka ýatyrdy. Tor birikdirmäňizi barlaň we haýyşyňyzy işleýän mahaly programmany kesmäň ýa-da ýapmaň. Islegiňizi gaýtadan synanyşmak isleseňiz, häzir ýerine ýetiriň. Sabyr edeniňiz we düşüneniňiz üçin sag boluň.

# dioConnectionError
source: Sorry, the app encountered a network error or interruption while communicating with the server. Please check your internet connection and make sure it is stable and reliable. If the problem persists, you can contact our support team for assistance. Thank you for your patience and understanding.
tk: Bagyşlaň, programma serwer bilen aragatnaşyk saklaýarka ulgam ýalňyşlygy ýa-da bökdençlik bilen ýüzbe-ýüz boldy. Internet birikmäňizi barlaň we durnukly we ygtybarlydygyna göz ýetiriň. Mesele dowam etse, kömek üçin goldaw toparymyza ýüz tutup bilersiňiz. Sabyr edeniňiz we düşüneniňiz üçin sag boluň.

# dioUnknown
source: Sorry, the app encountered an unknown or unexpected error that we could not identify or handle. Please report this error to our support team with as much detail as possible so that we can investigate and fix it as soon as possible. Thank you for your cooperation and feedback.
tk: Bagyşlaň, programma kesgitläp ýa-da dolandyryp bilmeýän näbelli ýa-da garaşylmadyk ýalňyşlyk bilen ýüzbe-ýüz boldy. Bu ýalňyşlygy mümkin boldugyça gysga wagtda derňäp we düzedip biler ýaly goldaw toparymyza mümkin boldugyça jikme-jik habar bermegiňizi haýyş edýäris. Hyzmatdaşlygyňyz we pikirleriňiz üçin sag boluň.

# reportDate
source: Date
tk: Sene

# reportOrderCount
source: Order count
tk: Sargyt sany

# reportTotalOrder
source: Total order
tk: Umumy satyş

# reportDeliveryCost
source: Delivery cost
tk: Eltip bermek bahasy

# reportWorkedTime
source: Worked time
tk: Işlenen wagt

# reportRating
source: Rating
tk: Reýting

# reportEarnings
source: Earnings
tk: Gazanan

source: Call
tk: Jaň et

source: Navigate
tk: Ýol gur

source: Cancel
tk: Ýap

source: Try again
tk: Täzeden

source: From
tk: Başlap

source: To
tk: Çenli

source: Reset
tk: Poz

source: Ok
tk: Bolýar
